In [3]:
thisdict={
    "brand":"BMW",
    "model":"MUstang",
    "Year":200
}
print(thisdict["brand"])

BMW

In [4]:
thisdict = {
"brand": "Ford",
"model": "Mustang",
"year": 1964,
"year": 2020
}
print(thisdict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 2020}

In [5]:
thisdict = {
"brand": "Ford",
"model": "Mustang",
"year": 1964
}
print(type(thisdict))

<class 'dict'>

In [6]:
thisdict = {
"brand": "Ford",
"electric": False,
"year": 1964,
"colors": ["red", "white", "blue"]
}
print(thisdict["colors"])

['red', 'white', 'blue']

In [7]:
car = {
"brand": "Ford",
"model": "Mustang",
"year": 1964
}
x = car.values()
print(x) #before the change
car["year"] = 2022
print(x) #after the change

dict_values(['Ford', 'Mustang', 1964])
dict_values(['Ford', 'Mustang', 2022])

In [8]:
car = {
"brand": "Ford",
"model": "Mustang",
"year": 1964
}
x = car.values()
y=car.keys()
print(x) #before the change
car["year"] = 2020
print(x) #after the change
print(y)

dict_values(['Ford', 'Mustang', 1964])
dict_values(['Ford', 'Mustang', 2020])
dict_keys(['brand', 'model', 'year'])

In [9]:
car = {
"brand": "Ford",
"model": "Mustang",
"year": 1964
}
x = car.items()
print(x) #before the change
car["color"] = "red"
print(x) #after the change

dict_items([('brand', 'Ford'), ('model', 'Mustang'), ('year', 1964)])
dict_items([('brand', 'Ford'), ('model', 'Mustang'), ('year', 1964), ('color', 'red')])

In [10]:
#PANDAS LIBRAY 3/31/2023
import pandas as pd
pd
x = ["Farman", "Afrah", "Atteib"]
y = pd.Series(x)
y

0    Farman
1     Afrah
2    Atteib
dtype: object

In [11]:
print(y[0])
print(y[1])

Farman
Afrah

In [12]:
import pandas as pd
x = ["Farman", "alI", "Atteib"]
y = pd.Series(x, index = ["a", "b", "c"])
print(y)

a    Farman
b       alI
c    Atteib
dtype: object

In [13]:
print(y["c"])
print(y["a"])

Atteib
Farman

In [14]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [15]:
import pandas as pd

In [16]:
import pandas as pd
x = ["Tamim", "Afrah", "Atteib"]
y = pd.Series(x)
y

0     Tamim
1     Afrah
2    Atteib
dtype: object

In [17]:
print(y[0])

Tamim

In [18]:
import pandas as pd
x = ["Tamim", "Afrah", "Atteib"]
y = pd.Series(x, index = ["a", "b", "c"])
print(y)

a     Tamim
b     Afrah
c    Atteib
dtype: object

In [19]:
print(y["b"])

Afrah

In [26]:
data = {
'Names': ["Tamim", "Afrah", "Atteib"],
'Age': [23, 20, 22]
}
data

{'Names': ['Tamim', 'Afrah', 'Atteib'], 'Age': [23, 20, 22]}

In [29]:
MyData = pd.DataFrame(data)
MyData

    Names  Age
0   Tamim   23
1   Afrah   20
2  Atteib   22

In [65]:
customers = pd.read_csv("Mall_Customers - Mall_Customers.csv")

In [66]:
customers.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                15.0                      39
1           2    Male   21                15.0                      81
2           3  Female   20                16.0                       6
3           4  Female   23                16.0                      77
4           5  Female   31                17.0                      40

In [67]:
customers.head(15)

    CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male   19                15.0                      39
1            2    Male   21                15.0                      81
2            3  Female   20                16.0                       6
3            4  Female   23                16.0                      77
4            5  Female   31                17.0                      40
5            6  Female   22                17.0                      76
6            7  Female   35                18.0                       6
7            8  Female   23                18.0                      94
8            9    Male   64                19.0                       3
9           10  Female   30                19.0                      72
10          11    Male   67                19.0                      14
11          12  Female   35                19.0                      99
12          13  Female   58                20.0                      15
13          14  Female   24                20.0                      77
14          15    Male   37                20.0                      13

In [68]:
customers.tail(5)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35               120.0                      79
196         197  Female   45               126.0                      28
197         198    Male   32               126.0                      74
198         199    Male   32               137.0                      18
199         200    Male   30               137.0                      83

In [69]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      192 non-null    float64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 7.9+ KB

In [70]:
customers.shape

(200, 5)

In [71]:
customer_df = customers.append(customers)
customer_df.shape

C:\Users\user\AppData\Local\Temp\ipykernel_8272\2596030322.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_df = customers.append(customers)

(400, 5)

In [72]:
customer_df = customers.append(customers)
customer_df.shape

C:\Users\user\AppData\Local\Temp\ipykernel_8272\2596030322.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_df = customers.append(customers)

(400, 5)

In [73]:
customer_df.drop_duplicates(inplace=True)

In [74]:
customer_df = customers.append(customers) # make a new copy
customer_df.drop_duplicates(inplace=True, keep=False)
customer_df.shape

C:\Users\user\AppData\Local\Temp\ipykernel_8272\1872585575.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  customer_df = customers.append(customers) # make a new copy

(0, 5)

In [75]:
customers.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [76]:
customers.rename(columns={
'Annual Income (k$)': 'Annual Income'
}, inplace=True)

customers.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [77]:
customers.isnull()

     CustomerID  Genre    Age  Annual Income  Spending Score (1-100)
0         False  False  False          False                   False
1         False  False  False          False                   False
2         False  False  False          False                   False
3         False  False  False          False                   False
4         False  False  False          False                   False
..          ...    ...    ...            ...                     ...
195       False  False  False          False                   False
196       False  False  False          False                   False
197       False  False  False          False                   False
198       False  False  False          False                   False
199       False  False  False          False                   False

[200 rows x 5 columns]

In [78]:
customers.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income             8
Spending Score (1-100)    0
dtype: int64

In [79]:
#Removing null values
customers.dropna()

     CustomerID   Genre  Age  Annual Income  Spending Score (1-100)
0             1    Male   19           15.0                      39
1             2    Male   21           15.0                      81
2             3  Female   20           16.0                       6
3             4  Female   23           16.0                      77
4             5  Female   31           17.0                      40
..          ...     ...  ...            ...                     ...
195         196  Female   35          120.0                      79
196         197  Female   45          126.0                      28
197         198    Male   32          126.0                      74
198         199    Male   32          137.0                      18
199         200    Male   30          137.0                      83

[192 rows x 5 columns]

In [80]:
customers.dropna(axis=1)

     CustomerID   Genre  Age  Spending Score (1-100)
0             1    Male   19                      39
1             2    Male   21                      81
2             3  Female   20                       6
3             4  Female   23                      77
4             5  Female   31                      40
..          ...     ...  ...                     ...
195         196  Female   35                      79
196         197  Female   45                      28
197         198    Male   32                      74
198         199    Male   32                      18
199         200    Male   30                      83

[200 rows x 4 columns]

In [82]:
income = customers['Annual Income']

In [83]:
income.head()

0    15.0
1    15.0
2    16.0
3    16.0
4    17.0
Name: Annual Income, dtype: float64

In [84]:
income_mean = income.mean()
income_mean

59.848958333333336

In [85]:
income.fillna(income_mean, inplace=True)

In [86]:
customers.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income             0
Spending Score (1-100)    0
dtype: int64

In [87]:
customers.describe()

       CustomerID         Age  Annual Income  Spending Score (1-100)
count  200.000000  200.000000     200.000000              200.000000
mean   100.500000   38.850000      59.848958               50.200000
std     57.879185   13.969007      25.999867               25.823522
min      1.000000   18.000000      15.000000                1.000000
25%     50.750000   28.750000      41.500000               34.750000
50%    100.500000   36.000000      59.924479               50.000000
75%    150.250000   49.000000      77.000000               73.000000
max    200.000000   70.000000     137.000000               99.000000

In [88]:
customers["Genre"].describe()

count        200
unique         2
top       Female
freq         112
Name: Genre, dtype: object

In [89]:
customers['Genre'].value_counts().head(10)

Female    112
Male       88
Name: Genre, dtype: int64

In [90]:
customers.corr()

,CustomerID,Age,Annual Income,Spending Score (1-100)
CustomerID,1.000000,-0.026763,0.961257,0.013835
Age,-0.026763,1.000000,-0.020049,-0.327227
Annual Income,0.961257,-0.020049,1.000000,0.017012
Spending Score (1-100),0.013835,-0.327227,0.017012,1.000000

In [92]:
#Relationships between Continuous Variables
Genre_col = customers['Genre']
type(Genre_col)

pandas.core.series.Series

In [93]:
Genre_col = customers[['Genre']]
type(Genre_col)

pandas.core.frame.DataFrame

In [94]:
subset = customers[['Genre', 'Annual Income']]
subset.head()

    Genre  Annual Income
0    Male           15.0
1    Male           15.0
2  Female           16.0
3  Female           16.0
4  Female           17.0

In [95]:
# Creating the DataFrame
data1 = pd.DataFrame({'Name':['Tamim', 'Abdirrahman', 'Maryam', 'Osman', 'Omar'],
'Age':[24, 23, 22, 22, 23]})
# Create the index
index1 = ['A', 'B', 'C', 'D', 'E']
# Set the index
data1.index = index1

In [96]:
data1

          Name  Age
A        Tamim   24
B  Abdirrahman   23
C       Maryam   22
D        Osman   22
E         Omar   23

In [97]:
Data_rows = data1.loc["B","Name"]
Data_rows

'Abdirrahman'

In [98]:
customer = data1.iloc[1]
customer

Name    Abdirrahman
Age              23
Name: B, dtype: object